const add = function (a, b, c) {
  return a + b + c;
};

// Определение функции начинается с ключевого слова function,
// за которым может следовать необязательное имя функции.
//     Имя функции это действие, глагол начинающийся с маленькой буквы,
//     отвечающий на вопрос 'Что сделать?'.
//     Например: findSmallesNumber, fetchUserInfo, validateInput.

// В круглых скобках идут параметры — перечисление данных которые функция будет получать из вне.
// Параметров может быть несколько, или вообще их не быть,
// тогда записываются просто пустые круглые скобки().

// Далее идет тело функции, заключенное в фигурные скобки { },
// содержащее инструкции которые необходимо выполнить при вызове функции.
// Тело функции всегда заключают в фигурные скобки, даже если оно состоит из одной инструкции.

// Оператор return определяет возвращаемое значение.
// Когда интерпретатор доходит до return, он сразу же выходит из функции,
// и возвращает это значение в то место кода, где функция была вызвана.

// Оператор return без выражения возвращает значение undefined.
// При отсутствии return в теле функции, она все равно вернет значение undefined.
